L = [123, 'spam', 1.23]         #список з трьох елементів
print(len(L))

print(L[0])                     #індексація по позиції та вивід елемента на екран
print(L[:-1])                   #нарізання списку і повертання нового списку
print(L + [4, 5, 6])            #конкатинація нових елементів у список
print(L * 2)                    #повторення списку 2 рази
print(L)                        #вхідний список не змінився

L.append('NI')                  #додовання а кінець списку(append) елемента 'NI'
print(L)
L.pop(2)                        #видалення(pop) з списку 3 елемент (1.23)
print(L)